package ru.job4j.exercises.branchingOperator;

/**
 * Ниже представлен метод isPositive(int number), который принимает целое число.
 *
 * Задание: Написать код, который выводит в консоль "Да", если число положительное, иначе "Нет".
 *
 * @author Ilya Kaltygin
 */
public class Task25 {
        public static void isPositive(int number) {
            System.out.println(number >= 0 ? "Да" : "Нет");
        }
}
