package ru.job4j.exercises.branchingOperator;

/**
 * Ниже представлен метод isEqual(int num1, int num2), который принимает 2 целых числа
 *
 * Задание: Написать код, который выводит в консоль "Да", если числа равны между собой, иначе "Нет".
 *
 * @author Ilya Kaltygin
 */
public class Task26 {
    public static void isEqual(int num1, int num2) {
        System.out.println(num1 == num2 ? "Да": "Нет");
    }
}
