package ru.job4j.exercises.sout;

/**
 * Напишите класс, который выводит на экран надпись
 *
 * @author Ilya Kaltygin
 */
public class Task14 {
    public static void main(String[] args) {
        System.out.print("H-e-l-l-o-,-f-r-i-e-n-d!");
    }
}
